Revit 2026 API

# CitySetErase Method

---

Removes a specified city from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	City item
)
```
```vb
Public Overridable Function Erase (
	item As City
) As Integer
```
```cpp
public:
virtual int Erase(
	City^ item
)
```
```fsharp
abstract Erase :
        item : City -> int
override Erase :
        item : City -> int
```

#### Parameters

item City
    The city to be erased.

#### Return Value

Int32The number of cities that were erased from the set.

#### Reference

CitySet Class

Autodesk.Revit.DB Namespace